[
	{
		"title": "Logicblocks",
		"icon": "rectangle-stack",
		"description": "The core building block. Each logicblock combines conditions and actions into a single automation rule. Name them, tag them, organize them by room or project.",
		"category": "Automation Logic"
	},
	{
		"title": "Complex conditions",
		"icon": "arrow-path-rounded-square",
		"description": "Combine multiple conditions with AND, OR, and NOT logic. \"If I'm home AND it's after sunset AND the front door sensor triggered\" — one rule, not three.",
		"category": "Automation Logic"
	},
	{
		"title": "Multiple triggers",
		"icon": "bolt",
		"description": "A single logicblock can be triggered by different events — a sensor update, a schedule, a webhook, or an IFTTT applet.",
		"category": "Automation Logic"
	},
	{
		"title": "Multiple actions",
		"icon": "rocket",
		"description": "One rule can control several devices and services at once. Turn on the lights, adjust the thermostat, and send a notification — all from one trigger.",
		"category": "Automation Logic"
	},
	{
		"title": "Condition sources",
		"icon": "squares-plus",
		"description": "Build conditions from time, location, device states, sensor data, IFTTT triggers, Tuya events, or webhook inputs. Mix and match freely.",
		"category": "Automation Logic"
	},
	{
		"title": "Action delays",
		"icon": "scale",
		"description": "Delay individual actions within a logicblock. \"Turn on lights now, close blinds in 30 minutes, adjust thermostat in 1 hour\" — all from one trigger.",
		"category": "Timing & Delays"
	},
	{
		"title": "Cron expressions",
		"icon": "clipboard-document-list",
		"description": "Schedule logicblock evaluations with cron precision. Every 5 minutes, every weekday at 7am, the first Monday of each month — whatever you need.",
		"category": "Timing & Delays"
	},
	{
		"title": "Sunset & sunrise",
		"icon": "sun",
		"description": "Time conditions that adapt to your location and the season. \"Between sunset and midnight\" just works — no manual adjustment needed.",
		"category": "Timing & Delays"
	},
	{
		"title": "Timeouts",
		"icon": "shield-check",
		"description": "Reset a condition after a set period. If your motion sensor doesn't report \"no motion\" reliably, a timeout handles it. Prevents false triggers from flaky sensors.",
		"category": "Timing & Delays"
	},
	{
		"title": "Time windows",
		"icon": "eye",
		"description": "Restrict when automations are active. \"Only on weekdays\", \"only between 22:00 and 06:00\", \"not on holidays\".",
		"category": "Timing & Delays"
	},
	{
		"title": "Auto-import",
		"icon": "arrow-trending-up",
		"description": "Connect your Tuya, Hue, Sonoff, or Tado account and your devices appear automatically. Real-time status updates, no manual configuration.",
		"category": "Devices"
	},
	{
		"title": "Custom devices",
		"icon": "light-bulb",
		"description": "Create your own virtual devices with boolean, string, or numeric attributes. Track states like \"vacation mode\", \"guest count\", or \"last watered\".",
		"category": "Devices"
	},
	{
		"title": "Device-centric dashboard",
		"icon": "computer-desktop",
		"description": "Devices are the primary entry point. See all your hardware at a glance, grouped by room, project, or integration.",
		"category": "Devices"
	},
	{
		"title": "Tagging & grouping",
		"icon": "identification",
		"description": "Tag devices, logicblocks, and variables. Filter your dashboard by tag. Manage a whole room or project as a unit.",
		"category": "Devices"
	},
	{
		"title": "Broad compatibility",
		"icon": "check-circle",
		"description": "Tuya covers thousands of white-label products. Sonoff/eWeLink covers WiFi and Zigbee. Hue for lighting. Tado for heating. Alexa for routines. IFTTT for 600+ more brands.",
		"category": "Devices"
	},
	{
		"title": "Normal mode",
		"icon": "check-circle",
		"description": "The default. Conditions met → actions run. Fully automatic, no intervention needed.",
		"category": "Execution Modes"
	},
	{
		"title": "Warning mode",
		"icon": "bell-alert",
		"description": "Apilio notifies you before executing. You get a window to cancel. Useful for high-impact automations like locking doors or turning off heating.",
		"category": "Execution Modes"
	},
	{
		"title": "Suggestion mode",
		"icon": "chat-bubble-left-ellipsis",
		"description": "Apilio evaluates conditions but waits for your manual confirmation before acting. You stay in the loop for sensitive routines.",
		"category": "Execution Modes"
	},
	{
		"title": "Override",
		"icon": "shield-check",
		"description": "Temporarily disable automations. Hosting a party? One toggle pauses all your lighting routines until you re-enable them.",
		"category": "Execution Modes"
	},
	{
		"title": "Event log",
		"icon": "clipboard-document-list",
		"description": "See every trigger, condition evaluation, and action execution in real time. Understand exactly what happened and when.",
		"category": "Monitoring & Notifications"
	},
	{
		"title": "CSV export",
		"icon": "document-chart-bar",
		"description": "Download your event history for analysis. Debug complex automations or track patterns over time.",
		"category": "Monitoring & Notifications"
	},
	{
		"title": "Email notifications",
		"icon": "bell",
		"description": "Get notified when specific logicblocks fire or conditions change. Up to 300 emails/month on higher plans.",
		"category": "Monitoring & Notifications"
	},
	{
		"title": "Centralized view",
		"icon": "squares-plus",
		"description": "One place for all devices, all brands. No switching between Tuya, Hue, and Tado apps to understand your system.",
		"category": "Monitoring & Notifications"
	},
	{
		"title": "Web & mobile",
		"icon": "device-phone-mobile",
		"description": "Access Apilio from any browser, any device. Check status, adjust settings, review logs — from anywhere.",
		"category": "Monitoring & Notifications"
	},
	{
		"title": "REST API",
		"icon": "cube-transparent",
		"description": "Full JSON API. Read and write variables, query condition states, trigger logicblock evaluations. Token-based authentication. Documented on Postman.",
		"category": "REST API & Webhooks"
	},
	{
		"title": "Incoming webhooks",
		"icon": "arrow-trending-up",
		"description": "Every variable and logicblock gets its own unique URL. Update values, trigger evaluations, activate or deactivate logicblocks — from any external system.",
		"category": "REST API & Webhooks"
	},
	{
		"title": "Outgoing webhooks",
		"icon": "rocket",
		"description": "When actions fire, Apilio can send HTTP requests to any URL. Custom headers, body, and authorization. Variable values injected into requests.",
		"category": "REST API & Webhooks"
	},
	{
		"title": "Extensibility",
		"icon": "key",
		"description": "Works with iOS Shortcuts (Siri), Tasker, Zapier, Locative, Life360, Node-RED, Home Assistant, or anything that can make an HTTP request.",
		"category": "REST API & Webhooks"
	},
	{
		"title": "Real-world uses",
		"icon": "phone-arrow-up-right",
		"description": "SMS via ClickSend, smart locks via Nuki, push via Pushover, voice queries via Siri Shortcuts, Android automation via Tasker.",
		"category": "REST API & Webhooks"
	}
]
